#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.dns_a_record_set.home: Reading...
tls_private_key.this: Refreshing state... [id=dddfc5fef3bfb624f0f8d3fc136efae552ca0ec6]
data.dns_a_record_set.home: Read complete after 0s [id=capnduck.ddns.net]
module.acm.data.aws_route53_zone.this: Reading...
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:009727205366:certificate/8ce6a6a4-d99c-448c-b2df-8934053f664d]
aws_key_pair.this: Refreshing state... [id=ec2-key-ssh]
aws_kms_key.tfstate: Refreshing state... [id=2345718b-73b8-4880-bb03-238c0ab24f02]
data.aws_route53_zone.this[0]: Reading...
aws_dynamodb_table.tfstate_lock: Refreshing state... [id=terraform-tfstate-lock]
aws_s3_bucket.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
data.aws_caller_identity.this: Reading...
module.zones.aws_route53_zone.this["jelliott.io"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R]
module.capnduck_records.data.aws_route53_zone.this[0]: Reading...
data.aws_caller_identity.this: Read complete after 0s [id=009727205366]
module.all_from_home.data.aws_vpc.this: Reading...
module.jelliott_records.data.aws_route53_zone.this[0]: Reading...
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-west-2:009727205366:cluster/default]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09289eb9291b2949c]
module.http_https_everywhere.data.aws_vpc.this: Reading...
data.aws_vpc.this: Reading...
module.acm.data.aws_route53_zone.this: Read complete after 0s [id=Z05346383CF9J3IH2UIOG]
aws_ecr_repository.this: Refreshing state... [id=capnduck]
aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:009727205366:secret:ec2-key-ssh-wLGmwY]
module.capnduck_records.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z05346383CF9J3IH2UIOG]
aws_kms_alias.tfstate: Refreshing state... [id=alias/terraform-state]
module.jelliott_records.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z04938253L3MEH8G7WE6R]
module.ecs.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=default]
module.capnduck_records.aws_route53_record.this[" MX"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_MX]
data.aws_route53_zone.this[0]: Read complete after 1s [id=Z05346383CF9J3IH2UIOG]
module.capnduck_records.aws_route53_record.this[" CAA"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_CAA]
module.capnduck_records.aws_route53_record.this["webmail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_webmail.capnduck.com_CNAME]
module.all_from_home.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.capnduck_records.aws_route53_record.this["drive CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_drive.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["groups CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_groups.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_NS]
module.http_https_everywhere.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.capnduck_records.aws_route53_record.this["calendar CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_calendar.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["sites CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_sites.capnduck.com_CNAME]
data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.capnduck_records.aws_route53_record.this["subsonic CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_subsonic.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["_dmarc TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__dmarc.capnduck.com_TXT]
module.capnduck_records.aws_route53_record.this[" TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_TXT]
module.capnduck_records.aws_route53_record.this["mail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_mail.capnduck.com_CNAME]
module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__c39759b1b4ce68a0a58295c7c4040ee4.www.capnduck.com._CNAME]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__7e17ed3c254a4598e2141844c108f21c.capnduck.com._CNAME]
module.jelliott_records.aws_route53_record.this["jenkins A"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jenkins.jelliott.io_A]
module.jelliott_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jelliott.io_NS]
module.all_from_home.aws_security_group.this: Refreshing state... [id=sg-0d859e28c6fb1bd67]
aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:009727205366:secret:ec2-key-ssh-wLGmwY|512B8462-5E43-4959-9F6D-E69066DAC2F6]
aws_ecr_lifecycle_policy.this: Refreshing state... [id=capnduck]
module.http_https_everywhere.aws_security_group.this: Refreshing state... [id=sg-0013e0e51b1939e0f]
data.aws_subnets.public: Reading...
data.aws_subnets.this: Reading...
data.aws_subnets.private: Reading...
aws_s3_bucket_acl.tfstate: Refreshing state... [id=capnduck-terraform-tfstate,private]
data.aws_subnets.public: Read complete after 0s [id=us-west-2]
aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
data.aws_subnets.private: Read complete after 0s [id=us-west-2]
aws_s3_bucket_versioning.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
data.aws_subnets.this: Read complete after 0s [id=us-west-2]
module.all_from_home.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3062342158]
module.all_from_home.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-3287070106]
module.all_from_home.aws_security_group_rule.tcp[2]: Refreshing state... [id=sgrule-1176284589]
module.all_from_home.aws_security_group_rule.tcp[7]: Refreshing state... [id=sgrule-3437537234]
module.all_from_home.aws_security_group_rule.tcp[3]: Refreshing state... [id=sgrule-2814207979]
module.all_from_home.aws_security_group_rule.tcp[5]: Refreshing state... [id=sgrule-3029087960]
module.all_from_home.aws_security_group_rule.tcp[6]: Refreshing state... [id=sgrule-400863898]
module.all_from_home.aws_security_group_rule.tcp[4]: Refreshing state... [id=sgrule-2243982184]
module.all_from_home.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-4022965131]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-067bf7d1691134086]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09518df5801cf8b31]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d4d4b200aefd41b0]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-087cf48ecff5bea3d]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-0b177960d81a2f1b7]
module.vpc.aws_route_table.private[5]: Refreshing state... [id=rtb-027c5b9b1eb67dea9]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a284c52e2f9146f9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a5bc5ec073940dca]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b94d7faf68936e3c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00dd8e548892facba]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c035011e361ea452]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f6f3efb89a553c06]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06f85801b091e2759]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0253184dc60aaf031]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-04a38528da1dcb2ed]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-06947ef14298c9e67]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b5922e4433793379]
aws_db_subnet_group.public: Refreshing state... [id=public]
module.http_https_everywhere.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3594773728]
aws_db_subnet_group.private: Refreshing state... [id=private]
module.http_https_everywhere.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-3558464871]
module.http_https_everywhere.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-8720741]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a770f077e552adef]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08aeb7e5177ca14d3]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0908e20c0a154e529]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b85474b5faae36af]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bd896340bfa89863]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09d42e8fc1a0347af]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-0872b6bcb7685165d]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-073a8a256a9e206ac]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-0a6ea86a864cfcd34]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00dd8e548892facba1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = "acl-058df8cecce6d17b4"
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "capnduck-default"
        }
      + tags_all               = {
          + "Name"        = "capnduck-default"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = "rtb-005425ea8ee4edd71"
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "capnduck-default"
        }
      + tags_all               = {
          + "Name"        = "capnduck-default"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "capnduck-default"
        }
      + tags_all               = {
          + "Name"        = "capnduck-default"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-09289eb9291b2949c"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @CapnDucks, Action: `pull_request`*